# ANÁLISIS DEL DATASET NYC AIRBNB.

## 1-PREPARACIÓN INICIAL

### 1.1-Inicialización de librerías.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn
from datetime import datetime, timedelta

### 1.2-Carga de datos.

In [12]:
# Archivo fuente de datos.
file = './Data/AB_NYC_2019.csv'

# Carga del archivo fuente y generación del DataFrame.
df = pd.read_csv(file)

Dado que en el enunciado del ejercicio se indica que se debe eliminar las columnas 'id', 'host_id' y 'host_name', se procede a ello.

In [13]:
df.drop(['id', 'host_id', 'host_name'], axis=1, inplace=True)

### 1.3-Funciones auxiliares.

## 2-EXPLORATORY DATA ANALYSIS (EDA).

### 2.1-Análisis preliminar.

#### 2.1.1-Inspección previa de los datos.

In [ ]:
# Se visualizan los 5 primeros registros del DataFrame.
df.head()

,name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,Clean & quiet apt home by the park,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,Skylit Midtown Castle,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,THE VILLAGE OF HARLEM....NEW YORK !,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,Cozy Entire Floor of Brownstone,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,Entire Apt: Spacious Studio/Loft by central park,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48895 entries, 0 to 48894
Data columns (total 13 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   name                            48879 non-null  object
 1   neighbourhood_group             48895 non-null  object
 2   neighbourhood                   48895 non-null  object
 3   latitude                        48895 non-null  float64
 4   longitude                       48895 non-null  float64
 5   room_type                       48895 non-null  object
 6   price                           48895 non-null  int64
 7   minimum_nights                  48895 non-null  int64
 8   number_of_reviews               48895 non-null  int64
 9   last_review                     38843 non-null  object
 10  reviews_per_month               38843 non-null  float64
 11  calculated_host_listings_count  48895 non-null  int64
 12  availability_365                48895 non-null  int64
dtypes: float64(3), int64(5), object(5)
memory usage: 4.8+ MB

Se observa que el DataFrame contiene 13 columnas y 48.895 registros.
<p>El tipo de datos de las columnas es variado: categóricas (tipo 'object') y numéricas (tipos 'int64' y 'float64').</p>
<p>Atendiendo a la cantidad de valores no nulos de cada columna, y teniendo en cuenta la cantidad total de registros, se observa que existen columnas con valores nulos. Estas columnas son: 'name' (tipo 'object'), 'last_review' (tipo 'object') y 'reviews_per_month' (tipo 'float64').</p>

In [16]:
df.describe(include='all')
#df.describe()

,name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
count,48879,48895,48895,48895.000000,48895.000000,48895,48895.000000,48895.000000,48895.000000,38843,38843.000000,48895.000000,48895.000000
unique,47905,5,221,NaN,NaN,3,NaN,NaN,NaN,1764,NaN,NaN,NaN
top,Hillside Hotel,Manhattan,Williamsburg,NaN,NaN,Entire home/apt,NaN,NaN,NaN,2019-06-23,NaN,NaN,NaN
freq,18,21661,3920,NaN,NaN,25409,NaN,NaN,NaN,1413,NaN,NaN,NaN
mean,NaN,NaN,NaN,40.728949,-73.952170,NaN,152.720687,7.029962,23.274466,NaN,1.373221,7.143982,112.781327
std,NaN,NaN,NaN,0.054530,0.046157,NaN,240.154170,20.510550,44.550582,NaN,1.680442,32.952519,131.622289
min,NaN,NaN,NaN,40.499790,-74.244420,NaN,0.000000,1.000000,0.000000,NaN,0.010000,1.000000,0.000000
25%,NaN,NaN,NaN,40.690100,-73.983070,NaN,69.000000,1.000000,1.000000,NaN,0.190000,1.000000,0.000000
50%,NaN,NaN,NaN,40.723070,-73.955680,NaN,106.000000,3.000000,5.000000,NaN,0.720000,1.000000,45.000000
75%,NaN,NaN,NaN,40.763115,-73.936275,NaN,175.000000,5.000000,24.000000,NaN,2.020000,2.000000,227.000000
max,NaN,NaN,NaN,40.913060,-73.712990,NaN,10000.000000,1250.000000,629.000000,NaN,58.500000,327.000000,365.000000

### 2.2-Análisis Univariante.

### 2.3-Análisis Bivariante.

### 2.4-Análisis Multivariante.

## 3-MODELADO DE DATOS.

### 3.1-PRE-PROCESAMIENTO.

#### 3.1.1-Variables Numéricas.

##### 3.1.1.1-Imputer.

##### 3.1.1.2-Scaler.

##### 3.1.1.3-Transformer.

#### 3.1.2-Variables Categóricas.

##### 3.1.2.1-Imputer.

##### 3.1.2.2-Encoder.

### 3.2-CLUSTERING Y SILUETAS.

### 3.3-SELECCIÓN DE COLUMNAS (FEATURING SELECTION).

### 3.3-PREDICCIONES.

#### 3.3.1-Regresiones.

#### 3.3.2-Clasificaciones (multiclase).

### 3.4-COMPARACIÓN DE RESULTADOS: VALIDACIÓN CRUZADA.